import React from "react";
import "./Blogs.css";
const Blogs = () => {
  return (
    <div>
      <div className="container all-container">
        <div className="con-1">
          <p>
            <strong>
              1) জাভাস্ক্রিপ্ট এবং নোডজের মধ্যে পার্থক্য।
              <br /> ➤
            </strong>
            জাভাস্ক্রিপ্ট একটি ভাষা যা ব্রাউজার দ্বারা লোড করা নথির অংশ হিসাবে
            ওয়েব ব্রাউজারগুলির মধ্যে চলে এবং একটি ক্লায়েন্ট-সাইড ডেভেলপমেন্ট
            ভাষা হিসাবে ব্যবহৃত হয়। এটি পৃষ্ঠাগুলির আচরণ প্রদান করে। HTML এর মত
            এটি শব্দার্থিক গঠন এবং CSS এর চেহারা এবং অনুভূতি প্রদান করে। NodeJs
            হল একটি ওপেন সোর্স, ক্রস-প্ল্যাটফর্ম পরিবেশ যা আপনাকে সার্ভার-সাইড
            অ্যাপ্লিকেশন তৈরি করতে দেয়।
          </p>
        </div>
        <div className="con-2">
          <p>
            <strong>
              2) আপনার কখন nodejs ব্যবহার করা উচিত এবং কখন MongoDB ব্যবহার করা
              উচিত?
              <br />➤
            </strong>
            Node.js হল একটি একক-থ্রেডেড, ওপেন-সোর্স, ক্রস-প্ল্যাটফর্ম রানটাইম
            পরিবেশ দ্রুত এবং মাপযোগ্য সার্ভার-সাইড এবং নেটওয়ার্কিং অ্যাপ্লিকেশন
            তৈরির জন্য। এটি V8 জাভাস্ক্রিপ্ট রানটাইম ইঞ্জিনে চলে, এবং এটি
            ইভেন্ট-চালিত, নন-ব্লকিং I/O আর্কিটেকচার ব্যবহার করে, যা এটিকে দক্ষ
            এবং রিয়েল-টাইম অ্যাপ্লিকেশনের জন্য উপযুক্ত করে তোলে। MongoDB হল
            একটি অবজেক্ট-ওরিয়েন্টেড, সরল, গতিশীল এবং মাপযোগ্য NoSQL ডাটাবেস।
            এটি NoSQL ডকুমেন্ট স্টোর মডেলের উপর ভিত্তি করে তৈরি। ডেটা
            অবজেক্টগুলি একটি সংগ্রহের ভিতরে পৃথক নথি হিসাবে সংরক্ষণ করা হয়।
          </p>
        </div>
        <div className="con-3">
          <p>
            <strong>
              3) SQL এবং NoSQL ডাটাবেসের মধ্যে পার্থক্য।
              <br />➤
            </strong>
            SQL বা স্ট্রাকচার্ড কোয়েরি ল্যাঙ্গুয়েজ হল রিলেশনাল ডাটাবেস
            ম্যানেজমেন্ট সিস্টেমের জন্য সবচেয়ে সাধারণ এবং জনপ্রিয় প্রোগ্রামিং
            ভাষা। এটি কাঠামোগত ডেটা এবং কৌশলগত বিশ্লেষণের জন্য ডেটা নিষ্কাশন,
            সঞ্চয়, সন্নিবেশ, মুছে ফেলা, আপডেট এবং পরিচালনা করার জন্য ডিজাইন করা
            একটি ভাষা। NoSQL ডাটাবেস ডেটা সঞ্চয় এবং পুনরুদ্ধারের জন্য একটি
            প্রক্রিয়া সরবরাহ করে যা টেবুলার আকারে ব্যতীত মডেল করা হয়। এটি
            কার্ল স্ট্রোজ দ্বারা 1998 সালে একটি অ-রিলেশনাল ডাটাবেস নামে পরিচিত
            হয়েছিল। এখন, এটি শুধুমাত্র SQL এর জন্য দাঁড়িয়েছে।
          </p>
        </div>
      </div>
    </div>
  );
};

export default Blogs;
